{
	"old_man" : 
	[
		true,
		[
			[
				[
					["Ah, a fellow hiker.", 2],
					["You want advice?", 2],
					["I am well past my years of hiking, but I can give you this.", 2],
					["The mountain holds beauties beyond your wildest imagination.", 2],
					["Each step you take reveals one more facet of the wonderous tapestry that is your journey. And with your pictures you can forever immortalize each step.", 2],
					["Good luck young hiker...", 2]
				],
			],
		]
	],
	"sign" :
	[
		false,
		[
			[
				[
					["Press C to take pictures of your own.", 3],
					["You can view and download pictures inside the Album menu.", 3]
				]
			],
			[
				[
					["Use arrow keys to pan the camera. Moving or pressing Control will cancel panning.", 3],
					["Note: You can only pan the camera within the extents of the room you are currently inside.", 3]
				],
				[
					["When jumping on a rock you have already jumped from, a colored line will appear showing the trajectory of your last jump.", 3],
					["The color also indicates the strength of your last jump. White is max charge.", 3],
					["Tip: You can stop charging by pressing the Control key", 3]
				],
				[
					["Pro Tip: Check the rock climbing category inside the settings menu for some handy settings.", 3],
					["You can aim with keyboard, turn off the last jump line, or slow down the charging speed of your jump.", 3]
				],
				[
					["When you touch one of these rocks you will attach to it.", 3],
					["Once attached a gray arrow will appear. You can aim this arrow with your mouse.", 3],
					["Holding space will charge your jump and on release you will jump in the direction of the arrow.", 3],
					["Note: When you jump off a rock you cannot control your movement in the air.", 3]
				]
			],
			[],
			[],
			[
				[
					["Congratulations! You finished the game!", 2],
					["A new menu is now available. In the Pause and Main menu you will find the \"Secrets\" menu, where you can view all the secrets you found.", 3],
					["You can restart the game to find any secrets you did not find.\nNote: Secrets will appear with color once you have found them.", 3],
					["Would you like to restart the game?\n\nWarning this will delete all your data! (Settings will be saved)", 3, "Restart", "Stay"],
				],		
			]
		]
	]
	
}